#include "Steps.h"
using namespace std;
using namespace std;
void Menu(int& out) {//меню игры
	bool b = 1;
	int a=1;
	for (; b;) {
		system("color 0");
		PlayMusic(L"misc/menuthem.mp3");
		system("cls");
		SetCursorPosition(0, 0);
		cout << R"(

      .-.                          .--------'             .-.                                     
        /|/|         /  .-.   /   (_)   /    /           (_) )-.                                  
       /   |  .-.---/---`-'  /-.       /    /-.   .-.       /   \  )  ( .  .-..  .-.   .-.  ).--.
      /    |./.-'_ /   /    /   )     /    /   |./.-'_     /     )(    ) )/   ))/   )./.-'_/       
 .-' /     |(__.' / _.(__._/    \  .-/.__.'    |(__.'   .-/  `--'  `--':'/   ('/   ( (__.'/       
(__.'      `.                     (_/  `-              (_/     `-._)          `-    `-            

)";
		SetCursorPosition(75, 20);
		cout << "Начать";
		SetCursorPosition(75, 21);
		cout << "Правила";
		SetCursorPosition(75, 22);
		cout << "Авторы";
		SetCursorPosition(75, 23);
		cout << "Выход";
		SetCursorPosition(95, 20);
		cout << "Управление - w a s d";
		SetCursorPosition(95, 21);
		cout << "Взаимодействие - e";
		SetCursorPosition(95, 22);
		cout << "Пропуск фразы - r";
		SetCursorPosition(74, 20);
		cout << ">";
		solution(23, 20, 74, a, 1);
		switch (a) {
		case 1:
			b = 0; break;
		case 2:
			system("cls");
			SetCursorPosition(0, 10);
			cout << R"(
                                   +------------------------------------------------------------------------------------+
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   +------------------------------------------------------------------------------------+
)";
			SetCursorPosition(37, 12);
			cout << "Управление указано в главном меню.";
			SetCursorPosition(37, 14);
			cout << "В этапе Дом используйте возможность для взаимодействия с окружением.";
			SetCursorPosition(37, 16);
			cout << "Совет: Изучайте все более детально.";
			SetCursorPosition(37, 18);
			cout << "В битве с так называемым босом вам нужно вовремя нажимать клавиши в тот момент,";
			SetCursorPosition(37, 20);
			cout << "когда обьект попадает на полосу.";
			SetCursorPosition(37, 22);
			cout << "На паре английского вам нужно написать перевод слов на английском.";
			SetCursorPosition(37, 24);
			cout << "На паре оаипа вам нужно показать конспект, которого может у вас не быть ( .";
			SetCursorPosition(37, 26);
			cout << "\033[96mВ страшном месте есть кусочек магии.\033[0m";
			SetCursorPosition(37, 28);
			cout << "В игре есть несколько концовок. Какая вам попадется, зависит от ваших решений.";
			SetCursorPosition(37, 30);
			cout << "Повеселитесь!)))";
			SetCursorPosition(37, 32);
			cout << "Выход >> |R|";
			skip('R', 'r');
			break;
		case 3:
			system("cls");
			SetCursorPosition(0, 10);
			cout << R"(
                                   +------------------------------------------------------------------------------------+
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   |                                                                                    |
                                   +------------------------------------------------------------------------------------+
)";
			SetCursorPosition(37, 12);
			cout << "Автор игры: Дубовик Иван ПО - 14";
			SetCursorPosition(37, 14);
			cout << "Благодарности:";
			SetCursorPosition(37, 16);
			cout << "Белый - главный мативатор и советник.";
			SetCursorPosition(37, 18);
			cout << "Метик - вдохновил на создание сюжета.";
			SetCursorPosition(37, 20);
			cout << "Джинглик - спонсировал годными советами и гитарой, он клевый чел спасибо ему!";
			SetCursorPosition(37, 22);
			cout << "Поршень - делал чай.";
			SetCursorPosition(37, 24);
			cout << "Касперский - все ради Ангелинки...";
			SetCursorPosition(37, 26);
			cout << "===================================================================================";

			SetCursorPosition(37, 28);
			cout << "Начало реализации проекта: 26.03";
			SetCursorPosition(37, 30);
			cout << "Конец:";
			SetCursorPosition(37, 32);
			cout << "Выход >> |R|";
			skip('R', 'r');
			break;
		case 4:

			out = 0;
			b = 0;
			break;

		}
		a = 1;
	}
	system("cls");
	StopMusic();
}
void Step1() {//первый ивент
	PlayMusic(L"misc/home.mp3");
	cout << R"(
     :::::::::::: mm      m        aaaaaaaa  :         WW  :::
  ::::aaaaaaaammmm mmmmmmmmmmmmm aa :::   aa :         WWW :::
  :: aa :::.. mmmmmmmm   mm  mm  ::::: ..  aa ::       WWW  ::
  :  a ::... mmmmm mmmmmmmmm##### ::: ...   aa::::     WWW WWW
 ::  a::..mmmmmmmmmm  m ::  # #### ::.....   aa:::     WWWWWWW
 :: a :.. m   mmmmm nnn::   # :: # ::... ..   a ::    WWWWWWWW
 :  aa :... mmmmm nnnn:::.   ::: ## :: ....  aa ::    WWWWWWWW
 ::  aaa:: aam  # :::::: .. ::   # :::::: aaaa:::     W W WWW:
 ::::::aaaaaaaaa## ::::: ..     ##a aaaaaaa ::::      W WWWW :
    :::::::::  ## ::#::.. ...   # aa :::::::: :       W W W ::
  .......  :::  #####::.. ..  ###   ::                W WWW ::
     ........     ## :: .   #######  : ###########    WW WW: :
   ##### .......   ############   ######        ##:   WW WW:::
 ###   ####### ..  #### :::::::::::   xxxxxxx   # :   WW WW ::
 ##  x::::::: ######  ::::::  xxxxxxxxxxxx  :   :::  WWWWWW ::
  # xxxxxxx ::::::::::: : xxxxx xxxxx::::::::   #::: WWWWW  : 
  #   xxxxxxxxxxxxxxxxxxxxx xxxxx :::::::    o  # ::: WWWW :: 
  # :::::::::xxxxx     xxxxx   ::::::::  ooooo  #  :::  WW :::
  #  oo::::::::: xxxxxxx  :::::      oooo ooo    # :::: WW : :
 # :  ooooooooooooo   :::::   ooooooo  oooo ::   ## : ::WW  : 
 # ::ooooooooo    ooooooooooooo     oo:::::::     #  :::WW  : 
##  ::::      ooooo    ooooooooooooo:: :::   yy    # :: WW :::
# yyyy  ::::::::::oooooo:::::::  ::: ::  yyyyy     ##   W W:::
# ::  yyyyyy  :::::::::: :::::::::::::yyyy :::      ##  WWW:::
# ::::::yy yyyyyyy     :::::::::::yyyyy :::::   zz   #  WWW:: 
# zz  ::::yyyyy   yyyyyy    yyyyyyyyy ::::   zzzz   ##   WW:: 
# zzzzzz  :::::::yyyyyyyyyyyyyyyy ::::     zzzz ::: # :: WW:::
# zzzzzzzzzz    ::::::::::::::::::    zzzzzz  :::::::::: WW:::
#::::::zzzzzzzz     ::     ::::    zzzzzz::::::    ::::  WW:::
# ::: :::: zzzzzzzzzzzzzzzzzzzzzzzzz  ::::  ::     ::: . WW:: 
# ::::   :::::  zzzzzzzzzzzzzzz    ::::    ::     ##: .. :::::
# :::::    :::::     :::::::::   ::       ::     ## :..  :::::
#  ::  ::   :::::::::::      :::         :     ::# ::.  :::  :
#:      ::::::::   ::::::       ::      :      ::  :    :W:   
#:::: ::   :   :::..::  :::::::  ::  ::::::::  :::      ::::  
 . ::..:::::::   ::....::::::::::  ::::::. :::::::  ::::::::  
 .    ....: ::::::  . .. :::  :::::::::::. ..  ::::::::::..:  
 .....  . ...:   .....      :::: ..   :::.....  : : :  :::.:  
 ..   ....   ......   .       :: ...... ..... ...::  . : :..
  .   .......  ..             .......................... : .
  .                                           .......... : .
                                                    ...:.. .
)";
	SetCursorPosition(80, 10);
	cout << "Кто-то > Проснись Мечислав!!!";
	skip('R', 'r');
	SetCursorPosition(80, 11);
	cout << "Кто-то > Это всего лишь сон...";
	SetCursorPosition(80, 12);
	cout << "На пары пора, первым ОаИП!";
	skip('R', 'r');
	system("cls");
	cout << R"(
       #########
##########################################
##                                      ##
##   @@@@@@@ @@@@@@@   @@@@@@@ @@@@@@@  ##
##   @     @ @     @ @ @     @ @     @  ##
##   @     @ @@@@@@@   @     @ @     @  ##
##   @     @ @     @ @ @     @ @     @  ##
##   @@@@@@@ @@@@@@@   @@@@@@@ @@@@@@@  ##
##                                      ##
##########################################

)";
	SetCursorPosition(1, 20);
	cout << R"(

)";
	SetCursorPosition(80, 10);
	cout << "> 8:00, я опаздываю, надо быстро собираться и бежать.";
	skip('R', 'r');
	system("cls");

}
void Step2(player& metik) {
	cout << R"(
 ------                .  .                                                                             ***    *******                 
      -`       -.,_   _   '           - .,_                                               __,... -.__  **  ******     *****            
                   `'--   `                ``'/--..,_                           .----''```_          `'-    *****         ***  *       
                          -     - ..,__              `''-- .,_                  .          ```''' ---  ******  ****          ****      
                          -            ``/'--- ..,_           ``'/--..,_        `  .--------------.-   *   ***  *  **          ****    
-.,_                      _        .--__            ``''-- ..,\_      ,.`''-- .,`  .              .    **   *** *  **           ****   
    `'-.                          _   --                        ``'/\-- ..,__   _``-._            .    ***    ***    ***        *  *   
       .      . -.,_              ` --      ........,,,,,,______    ---     -``''--   `'-._ ' -   . ******************* ***     *  *** 
       `      .    .`'-.         -                                 `````````'''''/''     - `'-._  . *** *  *****   * *'  `****  *   ***
       -      .    .   .   _     .   --      ..........,,,,,,______         .  _                `''   .***   **** ** **   **  ***   * *
              .    .   .   _     .                                    `````````_'' -, -, -_        -  `  **  *   **  **   _***  *   *  
              ------   .   -     .        --      .........,,,,,,______     .  -     `-.'-_-_             ****   * * **   *   **    *  
      _       .    .   .   -     .                -----._--              `````````'''    '-'.-_   -  _      ******  ***  **    *****  
      -       .    .   .   `     .         \/     .------'-.         \\     .  '-._         ``--_           ** **   ******       *   
      `       '    '_,.'-  .     .      ,-\\    .`         '          --,   .-._   '-._     -  -`-          *********,*              
      '       --''`        .     '  \.-`'     .'                        ''. . `''-._   '-._-    _    `       *       '            
    ,.-                   \'-    _-''       ,'`            ._             ``'_    `''-._   '-._ -   _                ` .           
-/\`                  \ /\    \-\\        _-'              . _               --,      `-'-._   '-._ -         __,... - `           
                 _.-,'     .-``          --                ---                 '',        '-'-._   ''---'''``                       
            \.-'`      _.'\            -``                                       `'.          '-'-._                _   _          
        \ /\        \-\\             .`'                    .-_                     `-_          `'-'-._            -   ,          
   _.-,'         \-\`              .'-                      .  _                      '-_            `' '-._        '     '          
-'`           .-`\               _'.`                       .  '                        ''.              `-.'-._              
          _-'`                  -_'                         .   _                         `'-                '-.'-._            
        -\                    -`-                           '----                            `-                  '- '-       

)";
	skip('R', 'r');
	SetCursorPosition(50, 30);
	cout << "А погода и вправду не плоха...";
	skip('R', 'r');
	StopMusic();
	PlayMusic(L"misc/boss.mp3");
	SetCursorPosition(50, 30);
	cout << "? >Эй!                                  ";
	skip('R', 'r');
	system("cls");
	cout << R"(
             :::      #############        :::::::::                                             
           :::  #######  #### ################  ::::::                                           
        ::::   #####  ################## #### :::::::                                            
       ::::    #    ii    ###     ###      ##  :::::::                                           
     :::::    ##iiiii                       ##    :::::                                          
     :::: ##### iii      #             #      ###### :::                                         
      ::  #   # iii### ###       #######      #    # : ::                                        
      ::  ##  # i i  ####          #####      #ii  # :  :                                        
      :::  #  #ii i   ##             ##        #ii # :  :                                        
       ::  #  #ii ii         #       ##        #ii # : ::                                        
       ::: ## #iii i       ###                 #   # : ::::                                      
       : :: #:##iiiii       ###                # ##  :  : :: ::                                  
    :: :  : :: # iiii                         ##     :   : :::::::                               
   ::  : ::::  ##   ii  ############         ##   :::::   : :mmm:::                              
   :   :::::    ####    #           #      #####   : ::   :mm   mm:::                            
  :: :::::::::  ## ###### iiiii        #########    :::::::mmm   mm :::                          
  :::: :     ###ii ii   ###   i    #######  i ###     :    : mmm  mm ::::                        
 ::: :: #####iii    iiiiiii##  ####       iiiiiiiii## :::   :: mm   m::::::::::                  
 :::::##  iii           iiiiii###########    iiiii   ####::  :: mm   mmmmmmm  ::                 
::   ##  iiiii             iiiiiii########## iiiiiiiii  ## ::::: m         mm  :::::             
:: ##  iiiiiii                iiiiiii  ###   iiii iiiiii  #   :::mmm        mmm  ::::            
:: # iii  i i                          ##  iiiiiiiii  iii ## ::::: mm   ### xxmm   :::           
:: # ii  iii                           ##  ii      iiiii i ##    m  mm### ###### m  :::          
:: # i  iii                            ##  ii          iiii ##   mmm##         ##xmm  :::        
:: ##iiiii                             ##  i               i ##  ###            #xxmm  ::::      
:: # iii i                             # # i               ii ####              ##xxmm  :::      
:::# ii ii         #i                  ### i                   #                 #xxxmm  ::::    
:  # ii i          #ii                 ## i                   ii                ##xxxxmm  :: ::  
 : #iii i          # i                 ###ii     ##          iii              ### xxxx m    :::::
   #i iii          #ii                 ### ii     ##        iiii             ## xxxx    mm   ::::
 ##ii ii           #ii                  ### i       #iiii ii  iii          ## m x         mmm:: :
#iiiiiii          ##i i                  ## ii       #  iiiiiii iii      ###  mm           m::  :
#iiiiii           ##iii                  ##  i        ##   ii  iiiii    ##      mm  mmmmmm:::::::
 #ii              ##ii                   ### i          ##  iiii     ### ::::::  mmmm   ::: :::  
 # i              #  i        #          # # ii          ###      #### :::    ::   mmmmm:::::    
 ##               #  i       ##          # #  i            #  #####   ::      :::::::   :: :     
  ##             ## ii      ##           #ii iii           ####   :::::          ::::::::        
   ##            # ii      #            ##iiii iii         #     :::               :::           
::  #           ##ii      #             ### iii iiiii     ## :::::                               
: : :##      ###         #              ##  iiiiii  ii    #:::::                                 
:: :: ########  #                       ## iii  iiii  iii#::::                                   
 : :::#          ##                     ##   iiiiiiiiii i::::                                    
 : : :            ##    ########         #           ii  # :                                     
 :  ::              ####        ########## ###############  :                                    

)";

	SetCursorPosition(120, 30);
	cout << "? >Подойди сюда.";
	skip('R', 'r');
	SetCursorPosition(120, 31);
	cout << "Ты >Мужик, я опаздываю!";
	skip('R', 'r');
	SetCursorPosition(120, 32);
	cout << "? >Давай давай.";
	skip('R', 'r');
	system("cls");
	cout << R"(
::::: mmmm mmmmmmmmmmmmmmmmmmmmmmmmmm        ::  ::::: ::       :::::::::::::::                                                         
::::::mmmmmmmmmmm  m   mmmm mm    mmmmmmmm    :::   ::  :    ::::        ::::  ::::::::                                                 
  ::mmmmm mmm mmmmmmmmmm mmmmmmm    mmmmmm     :::  ::  :  ::: ::::::::::: :::::::::::::::::                                            
 : :mmmmmm mmmmmmmm m  mm  mmmm m   m   mmm     ::: :: ::::    :      :::::       :::  :::          :::::                               
 ::mm mmmmmmmm    mmm       m    mmmm     mm    : :: ::::::    :   ::::       :::::   :      :::::::::::::::::                          
::  mmmm###                        mm      #    :   :::: ::   :   ::        ::::::   :   ::::::::::::::::::::::::                       
:  mm ##                                   ##   :  : ::::::   :  :::      ::::::    :   ::               ::: ::  ::                     
:  mm #             #####            ###    #   :  : :: ::    :  :      ::::::     :             ####      :::::  ::                    
   mmm#             #   ##ii       ### #    #   : :  :: :::   :         :::::::   :  #######     #  ### #  # ::::   ::                  
::   mm#            ## # # ii      # # #    #   : : ::::: :   ::     ::: :::: :  :: #####   ######    # ####::  :::  :  :               
 :  mmm###  ##       ##  #  i      ##  #    #   ::: :: : ::    :: :::   :::   :  :   ######  #     ### ###### ::::::: :::               
 ::: mmm ####  i      ####iii   # i ####    #    : ::::   :    :::    ::::   :: : ######## ######### ##### ##  :  : :  ::               
 : ::: mmm   #  i         i     # i         #   :  :::    ::   : ::  ::::    ::::     ####  ########### # ##### ::  :  ::               
  : ::: mmmm # i ii             ##ii       ##   :  : : ::  :  :    :  ::::   ::: ## ###      ## ##   # #####  ###::::  ::               
   :  ::m mm # iiiii           ##iii      ##    :::  : :   :::    : :::: :  ::   ####  ##########            #  # ::  : :               
    :  :::   # iiiii           iiiiii    ##    ::    : :   :    :::  ::  : :::  #### i                      ##  #    :  :               
     : : ::  ## iiiiii        ####  ii   #    ::     ::: ::    : :  ::   :  :   # # ii## ##    ####         #  ##   :  ::               
   :::::::::  ###   iiii  #####  ### i  ##    :      :::::    : :  :   ::   :     #ii  ###      ###  i      # ##  :::                   
 :::  :::::::: #####                   ###      :::           ::: ::   :    :    # ii ###      #### ii      ### :::::                   
: :::::   :  ::### ###########      # ## #       :::::       : : ::  :: :  :: :  #iii              ii      # # ::::                     
 ::       : #### #####  ############     ####      ::::      : ::  ::  ::  : ::  #iiii    ##      iiii     #  : : :                     
:    ####### ii      #######  ##            ###      ::::    ::  ::   ::  ::::   ##iiii              i    ## :  ::                      
 #####iiiiiiiii      i  ########  i iiiiiii   ###       :::  ::::    ::  ::::     ## iii ####           ###  :: ::                      
##   ii iiiii         ii  ######  iii  ii       ##        :: ::    :::   ::::      #   ii#      #########    ::::::                     
  iiiiiiiiii           ii  ####  i iiiiiii       ###       ::::   : :     :   ##### ### i   ##### # #######   :::: ::                   
iiii  ii                ii  #### iiii iiii        # ###     ::: ::  :  :: :   ###     #######   iiii#########   :::::::                 
iii  ii                 iiii  ##iiii iiii             #      :::   :   :  :  ### #######   ##  ii  i #  ######    :::::::               
i  ii                   i  iii# iii ii i              ##      : :::   :      #####   ## ##i   iiiiiii  ####  ###     :::::              
iiii                    ii   ii #iiii i                #       : ::::::       ## iiii  #  ii  ii ii ###     i  ####    ::::             
       #                 i    iii ii  i                ##      ::: :::     ### iiiiii  ###  iii ii##        iiiiii####   ::             
      i #                iii   ii  iiii                  #      :   ::    ##  i iii i    ###ii ii##ii        iiiiii  ##    :::          
      ii# i               ii   i#  iii      #            ##        :     ##  iii         ##ii#ii# # i         iii ii   #    ::          
     iii##i             i  ii iii# iiii     ###ii         #    ::  :    ##  iiii          # ii    #  i        i ii i  i##   :::         
     ii # i            iii  iiiii## ii        ##iii       #    ::  :     # iiii           #  ii   #  i        iiiii   i ##  ::          
     ii## ii        iiii    iiii  #  i          # iii     #    : : : ::  #  iii           #   i   #  ii         iiii ii  # :::          
     ii#   i        i i      iiii ## i           #  iii   #    : ::: ::  #   ii            #  i   #   ii          ii ii # :: ::         
     ii# iiii       ii       iiii ###ii         ## iiiiii #   :::  :  : #  iii             #   i  ##   i             ii # :  : :        
    iii##  iiii     i         iii ### i        ## ii  ii  #   :::  :  : #  iiii     #      ##  ii ##  ii     #       ii # :  : :        
   iii###   iiii    i         iii #   ii     ###iii    i  #   :::: :: ::##i  iii    ##     ##  ii  #         #       ii # :  :: :       
    iii###   iii   ii         iii # iiii     # ii      ii  #  :: : ::  : #i ii  ii   #                       #       ii #  : :: :       
    iii ###   ii   ii           i #ii  i    #  i    iiii ii#  :: ::::: : #iii   iii  #                       #       ii #  : : : :      
     iii ##   iii  ii           i #iiii ii  #  ii  iiii  ii#  :: ::: : ::#iii    i   ##     ii       i      ##ii     i ##  : : ::::::   
##   i ii ##   ii     ii        i## i iiiii #    ii    i i#   :: ::: ::: #i i    i    #     ii       i      #  ii    i ##  : : :: :     
 ####iiii ##    iii   iiii     ii#   i   iii#iiiiiiiiiii###   :::::   :: #iii         #     ii      i       #   i   ii  #  : :  ::      
     # ii##    iiiii  i   i   ii #   iiii ii##         ## #   ::::::     # iii       ##     i       i      ##   ii iii  #   :::::       

)";

	skip('R', 'r');
	system("cls");
	cout << R"(
             ::    ##############################     :                                                                                             
         ::::  ###    ## ### ##  ####  #############  :                                                        ::::::::::::::::::::::              
       ::: #########  ####  ## ########       #  #     ::                                                    :::::::::::::::::  ##  :: ::::        
     :::  ##############  ### # ########    ### #   :::::                                                 ::::::  ::   #    ::   #####  :::        
   :::    ########    ########### ####  ##########   :                                                  ::::  ##   :   ############  ### :::       
  :::    ## #####     ##              #####      ##  ::                                                :::: ### ######    ##         #  ##:::      
  ::  ##### ###  ######                           #  ::::                                              :::  #  ###############  #### ##### ::::    
  : : #   #  iii                                  #   ::::                                           ::: :#####  ##    #### #######  ##    :::::   
  : :##   # iiii  ##########     ########         ##   :::                                         :::: :  #######                       #  :::::  
    :##   #   i        #         i ### i         ## ##  :                                          :  ::: ##      #####      ######      ##  ::::: 
::::: ##  # ii i     ####        ii###ii        ##   # ::                                          :  :::####   ###               ##    #  ##::  : 
 :: :: #  ##ii ii     ###         iiiiii        #   ##::                                           :::::##  #  i    #          #        #     ##:::
  :: ::::# # i  ii         ##      iiii        ## ### ::                                            :::: ## ##ii  ####         ###      ##  ### : :
   :: :::: # ii  ii         ###               # ###  ::                                             ::::::## #ii  ###           ##       # ##  :   
     :: :: ## ii  i                         ## #    ::                                                 :::  ##ii                         # # ::: ::
    ::::   ##  iiii   # ###########       ###     :::                                                  :::  ##ii         ###              ##::: :::
     :::::  ####ii     ##         #       #     ::                                                     ::: #  iii                          #:::::::
        :::    ###ii                     #    :::                                                      ::: #   iii                       ###  ::   
           ::      i##                  ##  :::                                                      ::::: ##   iii  #######           ###:::::    
             ::::     ###           ####   :                                                         ::: :: ####  ii  ii            #### ::::      
             :::::::::: #############    :::                                                            ::::   #####   iiiiiiii   ###   ::::::     
                      :::::::        :::::                                                                 ::::::   ####      #####  ::::::::      
                    ::::::: ::::::::::::                                                                      :::::::::########   :::::            
                        :::::::::::::::                                                                             ::::::::::: ::::               

)";
	SetCursorPosition(50, 30);
	cout << R"(? >Парень, помоги рублем, мне на тралик надо.)";
	skip('R', 'r');
	SetCursorPosition(50, 30);
	cout << R"(У тебя как раз он есть, ровно рубль. Стоит ли его давать?
)";

	if (metik.ivent[4] == 0) {

		SetCursorPosition(50, 31);
		cout << "Да";
		SetCursorPosition(50, 32);
		cout << "Нет";
		int a=1;
		solution(32, 31, 49, a, 1);
		SetCursorPosition(50, 30);
		cout << R"(                                                              )";
		SetCursorPosition(50, 31);
		cout << R"(                                                              )";
		if (a == 1) {
			metik.ivent[4] = 1;
			SetCursorPosition(50, 30);
			cout << R"(Ты отдал рубль. Он выпал из рук мужика, ты замеялся.)";
			skip('R', 'r');
			SetCursorPosition(50, 31);
			cout << R"(Ему это явно не понравилось, он движется в твою сторону...)";
		}
		else {
			SetCursorPosition(40, 30);
			cout << R"(Ты сказал ему, что у тебя самого нет денег, он уверенно двигаетя в твою сторону.)";
			metik.carma++;
		}
	}
	else {
		SetCursorPosition(50, 30);
		cout << R"(После просмотра карманов рубля у вас не нашлось.)";
		skip('R', 'r');
		SetCursorPosition(50, 31);
		cout << R"(Больше дать вы не хотите, вы ему отказали, он приблежается к вам...)";
	}
	skip('R', 'r');
	system("cls");
	StopMusic();
}
void Step3(player& metik) {
	PlayMusic(L"misc/home.mp3");
	switch (metik.boss) {
	case 1:
		SetCursorPosition(2, 36);
		cout << "Tы были избиты мужиком, лицо в крови. Мужик испугался и убежал...              ";
		skip('R', 'r');
		system("cls");
		metik.lose = 1;
		return;
	case 2:
		SetCursorPosition(2, 36);
		cout << "Мужик встелен твоими мускулистыми руками, он что-то бормочет под нос, но ты не можешь разобрать его слов...";
		skip('R', 'r');
		metik.carma++;
		system("cls");
		break;
	case 3:
		SetCursorPosition(2, 36);
		cout << "Мужик пожал тебе руку, извинился и ушел в закат...              ";
		skip('R', 'r');
		system("cls");
		break;
	}
	cout << R"(
                .-----------------------------                                                                                     ..                      
                ..----.----------------------. .                                                                           .............                   
                .. .  .           .... ' : . . .                                                                      ......   ........ ...                
                .`..  .   xxxxxx   ... ''::. . `                                                                .  ..... ....................              
                ....  .   x         .. '' :' . -                                               m              .............   ..................           
                .. . .    xxxxx  xxxx  ' ::` `  -  ...,\__   ----------------_,,...  -   iii mmmmmm        .........   ::::::::::::::::::  .......         
                .. . ..   x   x  x  x '' : - `----------__```'''-----...,,__---------;-iiiii mmmmmm       .......    :::::::: :::::: :::::::.. ....        
                . ... .   xxxxx  xxxx '  : _ `--- '''```   --------------    ``''/ -;; iiii mm         ....  ..   :::::mmmm mmm  :::mmmmm:::::.. ....      
                .....  ..        x    '' ::  --    -------.   -----------  ... ::   ; iii i mm        .... ..  ::::  mm mmmmmmmmmmmmmmmm mm :: ......      
                ....    ..            ' :::  --    _::::: .    ,::::::: .   .. :: ;;;iiiii mmm       .......  ::mmmm mmmmmmmmmm  mmmmmmmmmmmm :: ::: .     
                .-......... xxxxx   . '':::  _.    ` :::: .    `  ::::: .  ..  : ;;; ii ii  mmm     ...... mmmmmmmmmmmmmmmmmmmmmmmmm       mmm :::::: .    
                .. ..   ....x      ... '::_   .   --------'     '-------'  .  :::;;;iii i   m m     .... mm:mmmmmmm mm   mm mmm     mmm   mmmmmmmm :: ...  
                '..... .    x     ....'': _   `.   ------_-     . -----.   .  : :;; i iiii  m mmm   ...  m::mmmmmmmmmmmm  mmmmmm  mmmmmmm  mmm mmm::: . .  
                -'.. ...    x     ... ' : -   `.    `:::::-     ` :::::   .. :: :;; i  i ii mm mm   ...  ::  ##m:  mmm  mmmmmmmmmm  mm mmmmm mmmm ::...  ..
                .` .  .     x    ... '' : -   _.   _:::::::-   _ :::::::- .  :  : ; ii  ii   mmm m  . . :: ###::::   mmm    :::  m mm mm   m  ## :::.......
   ...  ..      '` ...           ... '' ::,    .   `------- -  `--------' .. :: : ;;; ii iii  mm m  . . :  ## :     mm   ..:: :   mm            ## ::..  ..
    ..... ..    -- ...    xxxxx  ... '''::' __ .                          ..  ::::  ;;; iiiii  mmm  ...::  ## :  ##mm### ..:: - ######## :: ##  ##  : .  ..
     ..... .    __ ..       x    ... ' '::: __ .   .-------    .------.    ..... ::    ;;ii ii  mm  ...::  ##  :  ##  ## .  ::::##  ##   :  ##  ### : .. ..
   .. ........ _  ...       x     .  '''::: _- .   ` ::::.     `::::::`     ....  ::::  ;;i ii  m   ..  :   ## : ::####  ..... : ####    : ### #### : :... 
 .....  ... .. -  ...       x     .. '''::: -, .    :::::.      ::::::       ...     :: ;;i i   mm  ... ::  ## ::::      ......:::     ::: ##### ##: ::::. 
.. .. :::.......  . .       x     ...'' : : -. .  - :::::.    --------        .. .  ::: ; i i m m  .. .  :  ###:: ::::       .... :::::::: ### ##::: ::::..
 ...   :::..   __ ...              .. '' :: `' .  '------'    '      '        .. . : ::;; i i mm  ..  . ::: ### :  :   #       _   :::::  #####::::  :.. ..
  .::::::::::  -_ ...      x  x     .  '  : `` .                             .. .  : : ; i i  m   ..  .: ::  ## :::: . #####   _ ::::::  ####::::::::.. ...
 :::::::::: :  `- ...      x  x    ..  '' :::- .  .------    . -------.      . .  :: :;;ii i  m   ..  .: : ::###::: ..         _::::    ##  ::::: : ..  ...
   - ..,:::::  '- . .      xxxx    .    ' : :  .  .::::::_   - :::::: .      ...   : :;; i iim   ... . : :::::### ::..     ### ::::    ### ::: ::: ...  .. 
         ``''-- ,  ..         x  ..   ''' :::  .  .::::::'    _:::::::.       ..    : ;;;i  im   ....  ::::::  ### ::..#####  ::     ####  :: ::: ...  .   
------- .-------'  .       xxxx   .  '''' ::_  .  . ::::: _   - .,_   .$       ..   :: ;;;i imm  ..  ::::   #######          :::  #####  #::::::: . .      
 -._\-  .      .   .             '''''' ::: -  '  --------'   $    `'-.$      $$.. :::: ;;i imm .   :::::: ##     ##################      ##::::  . .      
 -\\'-  .      .- ..,,__        ''::::::  : `  _--   ......,,,$$__    $$      $$ .  ::: ;;i imm.. ::::::   ##  ###  ###  #     .#   #       ##:::: ..      
  - ..,\_      '--------``'/----..,,__----- ' -       $$     $$$    ``$$$'''''$$ --::::;;iiii m. ::  ##################        .##   ######### ::::...     
         ``'' --                      ``'/ ---       $$$$$   $$$$    $$$$$    $$$            ..  :: ##        # ##### ####     ' ###   #########::::....   
------------.............,,,,_,,,,_________                 $$$$$$           $$$$$          ..   :: #          # ## #     ########     ### ##  ## :::.. .. 
     --      \.-      -.,_        __..--.,_    ````,.-`,`````'''''\''/'''' __ -------\----  .   ::: #          #  ## ##       ##      ######    ## :::..  .
---- .,__ -,'............,`'---/'`_________`'---/\`     `-._  \.-` `-_   .'  `-_ \-\\  -_  ..  :::: ##          #######      ##-      ### #      # ::::    
         `''--                                 `````````````-\'''''''/`-`'    -\\---------     ::::: #           #  ###     ## _      ####                 

)";
	SetCursorPosition(2, 36);
	cout << "Ты пришел в университет... Людей мало, видимо пара уже началась.              ";
	skip('R', 'r');
	SetCursorPosition(2, 37);
	cout << "Надо спешить внутрь...              ";
	skip('R', 'r');
	system("cls");
	cout << R"(
                                  _______,,,,,,,.........       --
---------   ''''''''''``````````                                  
                 vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv  
        __,.. -. v------------------------------v  --------------------------
 --/''`` :::   ' v.                 .          .v    :::::::             ..... 
 . ::   :: :   ` v'  .----------.   `  mm mmm  `vv.. ::::::::: :::::::::::::.. 
 .-::--::-:::  _ v`  `          `   -   mmm m    v.  ::   :__:':::-'::`   :::..
 ' :-:-:::-+:    v-  `          _       m m m   _v.. -:::`:  :     ::::: ::  ..
 ` :-::::--:: _  v-  -  +---+          mm mmm   -v ..  :::::::   :::: :  :   ..
 - ::::::--:: -  v_  _  |210|    _   _ mm mmm   .v  ..  :::: : :::: ::  :    ..
 _ :-::+::-:: -  v      +---+ ;; -   - mmmm mm  `v   .  :: : ::::  :   :     ..
   :-::+::::: .  v       ::: ;;; -   ,  mmm  m   vv  .. :: ::::  ::_,,::. :-...
   :  :  :::: '  v      ::::;;;; .qr .   mmm m   _v   ..: :::```:  :::::::: ...
_  -::::- ::: `  v _  _ :::;;;;i '   '   mmm mm  -v    . ::::   :::::::  :  ...
- ::::::::::: _  v _  _:::;;;;ii -   `   mm mmm  .v    .  :::: :::::::: :  ... 
- :.::::::: ::   v _  -::;;; iii     _   mmmmmm  'v   .. :: : ::::  :::::: ... 
` : ::::::::::   v -  - ;;; iiiii        m mm m  -v   ..::  :: :   : ::::  ... 
' ::-:::::::--   v -  ` ;;;;iiiii _   _  m mm m   vv   .:  :       :: :  ....  
   :: ::  :  -   v `  .;;iiiiiiii -   _  mm mmmm  _v   ........      :   ..    
- ..,::::::  '   v .  . iiiiiiiii .   -   mmmmmm  ,v          ........        
       :`:: --   v .  '-----------'   .           'v  ----------------..-----
                 vv'                  '  _______,,,,,,,,...........       ---
 ----------    '''''''''''```````````    _______,,,,,,,,...........       ---
 ----------    '''''''''''```````````                                        
)";
	SetCursorPosition(2, 36);
	cout << "Страшно заходить, вдруг в деканат отправят...              ";
	skip('R', 'r');
	SetCursorPosition(2, 37);
	cout << "Ладно была не была...              ";
	skip('R', 'r');
	system("cls");
	SetCursorPosition(2, 10);
	cout << "Пара шла довольно тихо, но под конец преподователь сделала неожиданное заявление: сдаем конспекты на проверку...              ";
	skip('R', 'r');
	SetCursorPosition(2, 12);
	cout << "Ты залазишь в свой блатной портфель в поисках тетради.              ";
	skip('R', 'r');
	if (metik.ivent[1] == 0) {
		SetCursorPosition(2, 14);
		cout << "Та самая тетрадь, которая лежала на окне оказалась тетрадью по ОАИПу, в такие моменты приходит осознание, насколько ты фартовый.              ";
		skip('R', 'r');
		SetCursorPosition(2, 16);
		cout << "В конце пары ты отдаешь свою тетрадь на проверку и идешь на пару по инглишу, по которой сегодня вы будете писать слова.              ";
		skip('R', 'r');
		metik.carma++;
	}
	else {
		SetCursorPosition(2, 14);
		cout << "Тетради нет... Грустно, ведь на твоей памяти конспект там имелся.              ";
		skip('R', 'r');
		SetCursorPosition(2, 16);
		cout << "В конце пары ты просто ушел на английский...              ";
		skip('R', 'r');
	}
	system("cls");
}